male('Казимагомед Алиев').
male('Гамид Камбулатова').
male('Абдулла Алиев').
male('Магомедшарип Касимов').
male('Абдурахман Касимов').
male('Казанап Амиров').
male('Магомедсаид Касимов').
male('Исамагомед Арсланалиев').
male('Магомедсаид Арсланалиев').
male('Казимагомед Абдулаев').
male('Шамиль Абдулаев').
male('Насрула Абдулаев').
male('Магомедшапи Уджуев').
male('Казимагомед Уджуев').
male('Умахан Багомедов').
male('Мурад Касимов').
male('Магомед Касимов').
male('Магомедсалам Касимов').

female('Хайбат Камбулатова').
female('Рукият Алибекова').
female('Айшат Гамидова').
female('Умурахи Амирова').
female('Апам Магомедова').
female('Патимат Гапизова').
female('Апам Касимова').
female('Зумрад Алиева').
female('Зайнам Алиева').
female('Сапият Алиева').
female('Шамай Арсланалиева').
female('Патимат Касимова').
female('Калимат Касимова').
female('Джамиля Гасанова').
female('Барият Уджуева').
female('Заира Уджуева').
female('Амина Уджуева').
female('Лаура Уджуева').
female('Барият Магомедова').
female('Эмма Касимов').
female('Ислам Касимов').
female('Джамиля Багомедова').
female('Зубалжат Алиева').

parents('Магомед Касимов','Магомедсалам Касимов','Зубалжат Алиева').
parents('Патимат Касимова','Магомедсалам Касимов','Зубалжат Алиева').
parents('Калимат Касимова','Магомедсалам Касимов','Зубалжат Алиева').
parents('Зубалжат Алиева','Казимагомед Алиев','Хайбат Камбулатова').
parents('Зумрад Алиева','Казимагомед Алиев','Хайбат Камбулатова').
parents('Зайнам Алиева','Казимагомед Алиев','Хайбат Камбулатова').
parents('Сапият Алиева','Казимагомед Алиев','Хайбат Камбулатова').
parents('Хайбат Камбулатова','Гамид Камбулатова','Рукият Алибекова').
parents('Казимагомед Алиев','Абдулла Алиев','Айшат Гамидова').
parents('Магомедсалам Касимов','Магомедшарип Касимов','Умурахи Амирова').
parents('Апам Касимова','Магомедшарип Касимов','Умурахи Амирова').
parents('Магомедсаид Касимов','Магомедшарип Касимов','Умурахи Амирова').
parents('Магомедшарип Касимов','Абдурахман Касимов','Апам Магомедова').
parents('Умурахи Амирова','Казанап Амиров','Патимат Гапизова').
parents('Магомедсаид Арсланалиев','Исамагомед Арсланалиев','Зумрад Алиева').
parents('Шамай Арсланалиева','Исамагомед Арсланалиев','Зумрад Алиева').
parents('Шамиль Абдулаев','Казимагомед Абдулаев','Зайнам Алиева').
parents('Насрула Абдулаев','Казимагомед Абдулаев','Зайнам Алиева').
parents('Барият Уджуева','Магомедшапи Уджуев','Апам Касимова').
parents('Заира Уджуева','Магомедшапи Уджуев','Апам Касимова').
parents('Амина Уджуева','Магомедшапи Уджуев','Апам Касимова').
parents('Лаура Уджуева','Магомедшапи Уджуев','Апам Касимова').
parents('Казимагомед Уджуев','Магомедшапи Уджуев','Апам Касимова').
parents('Джамиля Багомедова','Умахан Багомедов','Барият Уджуева').
parents('Мурад Касимов','Магомедсаид Касимов','Барият Магомедова').
parents('Эмма Касимов','Магомедсаид Касимов','Барият Магомедова').
parents('Ислам Касимов','Магомедсаид Касимов','Барият Магомедова').
